export const valueTypes = {
  data () {
    return {
      valueTypes: [
        {code: 'RANGE', name: '范围'},
        {code: 'INFO', name: '信息'},
        {code: 'VALUE', name: '具体值'}
      ]
    }
  }
}

export const qcItems = {
  data () {
    return {
      qcItems: [
        '细度',
        '颜色',
        '6转粘度',
        '60转粘度',
        '红外匹配度',
        '板面状态',
        '固化性',
        '常温五分钟流油',
        '75度烤十分钟流油',
        '感光性',
        '显影(预考40min)',
        '显影(预考60min)',
        '显影(预考70min)',
        '显影(预考80min)',
        '显影(放置12小时)',
        '显影(放置24小时)',
        '表面张力',
        '桥线',
        '硬度',
        '附着力',
        '耐焊性',
        '耐溶剂性',
        '耐酸碱性',
        '针孔测试',
        '叠板',
        '低能量显影不发白',
        '隔夜曝光级数',
        '隔夜显影',
        '解像性',
        '去膜性',
        '耐酸不发白',
        '耐切削液',
        '抗蚀刻性',
        '耐电镀性',
        '贮存寿命',
        '有害物质含量限值',
        '阻燃性',
        '耐低高温循环',
        '耐热冲击',
        '绝缘电阻',
        '溶解性',
        '软化点',
        '环氧值',
        '挥发份',
        '气味',
        '吸油量',
        '酸值',
        '固含量',
        '触变性',
        '尺寸',
        '重量',
        '洁净度',
        '做板',
        '抗摔强度', // 罐子
        '密封性', // 罐子
        '耐热性能', // 罐子
        '缝合密合度' // 过滤丝网
      ]
    }
  }
}
